Autodesk.Revit.DB.BuiltInFailures.BendFailures.NotBentSymbolicLine
While making curved beam type "[Type Name]" some Symbolic Line elements were not created

Autodesk.Revit.DB.BuiltInFailures.BendFailures.NotBentSymbol
While making curved beam type "[Type Name]" Symbol elements were not created

Autodesk.Revit.DB.BuiltInFailures.BendFailures.NotBentSharedFamily
While making curved beam type "[Type Name]" Shared Family Instances were not created

Autodesk.Revit.DB.BuiltInFailures.BendFailures.NotBentRefPlane
While making curved beam type "[Type Name]" some Reference Plane elements were not created

Autodesk.Revit.DB.BuiltInFailures.BendFailures.NotBentRefLine
While making curved beam type "[Type Name]" some Reference Line elements were not created

Autodesk.Revit.DB.BuiltInFailures.BendFailures.NotBentOpening
While making curved beam type "[Type Name]" Opening elements were not created

Autodesk.Revit.DB.BuiltInFailures.BendFailures.NotBentModelLine
While making curved beam type "[Type Name]" some Model Line elements were not created

Autodesk.Revit.DB.BuiltInFailures.BendFailures.NotBentMaskingRegion
While making curved beam type "[Type Name]" Masking Region elements were not created

Autodesk.Revit.DB.BuiltInFailures.BendFailures.NotBentImport
While making curved beam type "[Type Name]" CAD File elements were not created

Autodesk.Revit.DB.BuiltInFailures.BendFailures.NotBentImage
While making curved beam type "[Type Name]" Image elements were not created

Autodesk.Revit.DB.BuiltInFailures.BendFailures.NotBentFilledRegion
While making curved beam type "[Type Name]" Filled Region elements were not created

Autodesk.Revit.DB.BuiltInFailures.BendFailures.NotBentDetailComponent
While making curved beam type "[Type Name]" 2D Detail Component elements were not created

Autodesk.Revit.DB.BuiltInFailures.BendFailures.NotBentControl
While making curved beam type "[Type Name]" some Control elements were not created

Autodesk.Revit.DB.BuiltInFailures.BendFailures.DeleteSegmentInBankNotAllowed
Delete a segment in a bank is not allowed

Autodesk.Revit.DB.BuiltInFailures.BendFailures.DeleteMiddleBendNotAllowed
Delete a middle bend in a bank is not allowed

Autodesk.Revit.DB.BuiltInFailures.BendFailures.BendAngleIsUnacceptable
The angle of the bend/elbow is unacceptable

Autodesk.Revit.DB.BuiltInFailures.BendFailures
Failures about Bends.